<?php

namespace Database\Seeders;

use App\Models\Feature;
use App\Traits\GeneralTrait;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class FeaturesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('features')->delete();
        DB::table('features_property_sub_categories')->delete();
//        $features= [
//            'سور خارجي',//منزل
//            'حديقة',//منزل,شقة
//            'مسبح',//منزل,مزرعة,شقة
//            'مسبح خاص',//منزل,مزرعة
//            'صالة رياضية',//شقة,منزل,مزرعة
//            'مفروش',
//            'مصعد',//شقة
//            'تكييف مركزي',//شقة//مزرعة
//            'تكييف منفصل',//شقة//مزرعة
//            'نظام كاميرات',//شقة
//            'نظام حراسة',//مزرعة//شقة
//            'اطلالة على البحر',//شقة
//            'ملحق خارجي',//مزرعة//منزل
//            'طاقة شمسية',//منزل,شقة,//مزرعة
//            'خزان مياه شمسي',
//            'اشجار مزروعة',//مزرعة
//            'حظائر / مخازن حيوانات',//مزرعة
//            'معدات زراعية متضمنة',//مزرعة
//            'مرافق تخزين مبردة',//مزرعة
//            'قريب من الطريق الرئيسي',//مزرعة//منزل//شقة
//            'إمكانية التقسيم',//ارض تجارية
//            'موقف سيارات خاص',//مزرعة//شقة,منزل
//            'موقف سيارات',//شقة,منزل
//            'قريب من موقف سيارات',//ارض تجارية//مزرعة//شقة,منزل
//            'انترنت',//ارض تجارية//مزرعة//شقة,منزل
//            'قريبة من الموانئ',//ارض صناعية
//            'كهرباء عالية الجهد',//ارض صناعية
//            'قريبة من المطار',//ارض صناعية//ارض تجارية//مزرعة//شقة,منزل
//            'نظام صرف صناعي',//ارض صناعية
//            'مساحات مخصصة للتخزين',//ارض صناعية
//            'مرافق نقل ثقيليات',//ارض صناعية
//            'أرض مربعة',//ارض سكنية
//            'أرض مستطيلة',//ارض سكنية
//            'اطلالة على مناطق خضراء',//ارض سكنية
//            'قريب من مراكز ترفيهية',//ارض سكنية//ارض تجارية//مزرعة//شقة,منزل
//            'تحويل لمشاريع سياحية',//ارض سكنية//ارض تجارية//ارض زراعية
//            'طرق معبدة',//ارض زراعية//ارض سكنية//ارض تجارية
//            'قريبة من اسواق التصدير',//ارض زراعية
//            'إضاءة طبيعية',//مكتب//مزرعة//شقة,منزل
//            'خدمات تنظيف يومية',//مكتب
//            'إضاءة ليدات',//مزرعة//شقة,منزل//مكتب
//            'نظام تهوية',//مكتب
//            'ارضية خرسانية',
//            'ارفف معدنية ثابتة',
//            'إضاءة قابلة للتعديل',
//            'نظام صوتيات احترافي',
//            'استضافة فعاليات متنوعة',
//            'إضاءة متحركة',
//            'مرافق للاستراحات',
//            'تجهيزات تقنية',
//            'سقف عالي',
//        ];
//
//        foreach ($features as $feature) {
//            Feature::create(['name' => $feature,'classification_id'=>1]);
//        }

        $this->insert(
            [
                "مصعد",
                "تكييف مركزي",
                "تكييف منفصل",
                "نظام كاميرات",
                "نظام حراسة",
                "اطلالة على البحر",
                "اطلالة على مناطق خضراء",
                "موقف سيارات",
                "قريب من موقف سيارات",
                "انترنت",
                "قريب من مراكز ترفيهية",
                "إضاءة طبيعية",
                "خدمات تنظيف يومية",
                "إضاءة ليدات",
                "نظام تهوية",
                "إضاءة قابلة للتعديل",
                "تجهيزات تقنية",
                "مفروش"
            ],1,1
        );
        $this->insert(
            [
                "سور خارجي",
                "حديقة",
                "مسبح",
                "مسبح خاص",
                "صالة رياضية",
                "مفروش",
                "مصعد",
                "تكييف مركزي",
                "تكييف منفصل",
                "نظام كاميرات",
                "نظام حراسة",
                "اطلالة على البحر",
                "ملحق خارجي",
                "طاقة شمسية",
                "خزان مياه شمسي",
                "اشجار مزروعة",
                "موقف سيارات خاص",
                "موقف سيارات",
                "انترنت",
                "إضاءة طبيعية",
                "خدمات تنظيف يومية",
                "إضاءة ليدات",
                "نظام تهوية",
                "إضاءة قابلة للتعديل",
                "نظام صوتيات احترافي",
                "تجهيزات تقنية"
            ],2,1
        );
        $this->insert(
            [
                "سور خارجي",
                "حديقة",
                "مسبح",
                "مسبح خاص",
                "صالة رياضية",
                "مفروش",
                "تكييف منفصل",
                "نظام كاميرات",
                "نظام حراسة",
                "ملحق خارجي",
                "طاقة شمسية",
                "خزان مياه شمسي",
                "اشجار مزروعة",
                "حظائر / مخازن حيوانات",
                "معدات زراعية متضمنة",
                "موقف سيارات خاص",
                "انترنت",
                "نظام صرف صناعي",
                "إضاءة طبيعية",
                "إضاءة ليدات",
                "مرافق للاستراحات"
            ],3,1
        );
        $this->insert(
            [
                "قريب من الطريق الرئيسي",
                "إمكانية التقسيم",
                "قريب من موقف سيارات",
                "قريبة من الموانئ",
                "قريبة من المطار",
                "مرافق نقل ثقيليات",
                "أرض مربعة",
                "أرض مستطيلة",
                "قريب من مراكز ترفيهية",
                "تحويل لمشاريع سياحية",
                "طرق معبدة",
                "قريبة من اسواق التصدير"
            ],4,1
        );
        $this->insert(
            [
                "قريب من الطريق الرئيسي",
                "إمكانية التقسيم",
                "قريبة من الموانئ",
                "كهرباء عالية الجهد",
                "قريبة من المطار",
                "نظام صرف صناعي",
                "مرافق نقل ثقيليات",
                "أرض مربعة",
                "أرض مستطيلة",
                "طرق معبدة",
                "قريبة من اسواق التصدير",
                "ارضية خرسانية"
            ],5,1
        );
        $this->insert(
            [
                "قريب من الطريق الرئيسي",
                "إمكانية التقسيم",
                "موقف سيارات",
                "قريب من موقف سيارات",
                "انترنت",
                "أرض مربعة",
                "أرض مستطيلة",
                "اطلالة على مناطق خضراء",
                "قريب من مراكز ترفيهية",
                "طرق معبدة",
                "إضاءة طبيعية"
            ],6,1
        );
        $this->insert(
            [
                "قريب من الطريق الرئيسي",
                "إمكانية التقسيم",
                "نظام صرف صناعي",
                "أرض مربعة",
                "أرض مستطيلة",
                "اطلالة على مناطق خضراء",
                "طرق معبدة",
                "إضاءة طبيعية",
                "مرافق للاستراحات",
                "اشجار مزروعة",
                "حظائر / مخازن حيوانات"
            ],7,1
        );
        $this->insert(
            [
                "مصعد",
                "تكييف مركزي",
                "تكييف منفصل",
                "نظام كاميرات",
                "نظام حراسة",
                "موقف سيارات خاص",
                "موقف سيارات",
                "انترنت",
                "إضاءة طبيعية",
                "خدمات تنظيف يومية",
                "إضاءة ليدات",
                "نظام تهوية",
                "إضاءة قابلة للتعديل",
                "تجهيزات تقنية"
            ],8,1
        );
        $this->insert(
            [
                "تكييف منفصل",
                "نظام كاميرات",
                "نظام حراسة",
                "موقف سيارات",
                "قريب من موقف سيارات",
                "انترنت",
                "إضاءة طبيعية",
                "خدمات تنظيف يومية",
                "إضاءة ليدات",
                "نظام تهوية",
                "إضاءة قابلة للتعديل"
            ],9,1
        );
        $this->insert(
            [
                "سور خارجي",
                "نظام كاميرات",
                "نظام حراسة",
                "طاقة شمسية",
                "قريب من الطريق الرئيسي",
                "موقف سيارات",
                "قريبة من الموانئ",
                "كهرباء عالية الجهد",
                "قريبة من المطار",
                "مرافق تخزين مبردة",
                "مساحات مخصصة للتخزين",
                "مرافق نقل ثقيليات",
                "إضاءة ليدات",
                "نظام تهوية",
                "ارضية خرسانية",
                "ارفف معدنية ثابتة",
                "سقف عالي"
            ],10,1
        );
        $this->insert(
            [
                "تكييف مركزي",
                "تكييف منفصل",
                "نظام كاميرات",
                "نظام حراسة",
                "موقف سيارات خاص",
                "موقف سيارات",
                "انترنت",
                "إضاءة طبيعية",
                "خدمات تنظيف يومية",
                "إضاءة ليدات",
                "نظام تهوية",
                "إضاءة قابلة للتعديل",
                "إضاءة متحركة",
                "نظام صوتيات احترافي",
                "تجهيزات تقنية",
                "سقف عالي"
            ],11,1
        );
        $this->insert(
            [
                "تكييف مركزي",
                "تكييف منفصل",
                "نظام كاميرات",
                "نظام حراسة",
                "موقف سيارات خاص",
                "موقف سيارات",
                "انترنت",
                "إضاءة طبيعية",
                "خدمات تنظيف يومية",
                "إضاءة ليدات",
                "نظام تهوية",
                "إضاءة قابلة للتعديل",
                "إضاءة متحركة",
                "نظام صوتيات احترافي",
                "استضافة فعاليات متنوعة",
                "تجهيزات تقنية",
                "سقف عالي"
            ],12,1
        );

    }

    protected function insert($features,$category_id,$classification_id)
    {
        foreach ($features as $feature) {
            $feature_object=new Feature();
            $feature_object->name=strval($feature);
            $feature_object->classification_id=$classification_id;
            $feature_object->save();
            $feature_object->property_sub_categories()->attach($category_id);
        }
    }
}
